final-project/meshes/prelim_run/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    IsoQ_walls
    {
        type            patch;
        physicalType    patch;
        nFaces          19;
        startFace       2856;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          31;
        startFace       2875;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          80;
        startFace       2906;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          30;
        startFace       2986;
    }
    right
    {
        type            wedge;
        physicalType    patch;
        nFaces          546;
        startFace       3016;
    }
    left
    {
        type            wedge;
        physicalType    patch;
        nFaces          546;
        startFace       3562;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       2856;
    }
)

// ************************************************************************* //
