final-project/meshes/prelim_run/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (1 0 0);
        value           uniform (1 0 0);
    }

    IsoQ_walls 
    {
        type            noSlip;
    }

    right 
    {
        type            wedge;
    }
    
    left
    {
        type            wedge;
    }
    
    top
    {
        type            fixedValue;
        value           uniform (1 0 0);
}

// ************************************************************************* //
